src/cf/InformationRegisters/СоответствиеНастроекИнтеграцииУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНастроекИнтеграцииУНФ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Интеграция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НастройкиИнтеграцииСПлатежнымиСистемамиРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПлатежнойСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияQRКода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПоступленияОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоступленияОплатыСБПb2b</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СпособОплатыПлатежныхСистемРМК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СоответствиеНастроекИнтеграцииУНФ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройку интеграции с платежными системами на основании
// данных продажи / возврата
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияРМК - организация из документа продажи;
//  ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектРМК - касса из документа продажи;
//
// Возвращаемое значение:
//  ТаблицаЗначений - настройки интеграции с платежной системой.
//
Функция НастройкиИнтеграции(Организация, ТорговыйОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ТорговыйОбъект", ТорговыйОбъект);
	
	Запрос.Текст = ИнтеграцияСПлатежнымиСистемамиУНФ.ТекстЗапросаНастройкиИнтеграции(
		,
		"СоответствиеНастроекИнтеграцииУНФ");
	
	Если Не ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Интеграции 		 = РезультатЗапроса.Выгрузить();
	
	Если Интеграции.Количество() > 0 Тогда
		Возврат Интеграции;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция НастроенаОплатаПлатежнойСистемой() Экспорт
	
	НастройкиПодключения = Новый Структура();
	
	НастройкиПодключения.Вставить("ИспользоватьОплатуПлатежнымиСистемами",	Ложь);
	НастройкиПодключения.Вставить("ИспользоватьОплатуСБП", 					Ложь);
	НастройкиПодключения.Вставить("ИспользоватьОплатуЮКасса", 				Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 	Неопределено);
	Запрос.УстановитьПараметр("ТорговыйОбъект", Неопределено);
	
	Запрос.Текст = ИнтеграцияСПлатежнымиСистемамиУНФ.ТекстЗапросаНастройкиИнтеграции(
		,
		"СоответствиеНастроекИнтеграцииУНФ");

	Если ЗначениеЗаполнено(Запрос.Текст)Тогда
	
		УстановитьПривилегированныйРежим(Истина);

		РезультатЗапроса = Запрос.Выполнить();
		ТипыИнтеграций	 = РезультатЗапроса.Колонки.Интеграция.ТипЗначения;
	
		Для Каждого ТипИнтеграции Из РезультатЗапроса.Колонки.Интеграция.ТипЗначения.Типы() Цикл
		
			МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипИнтеграции);
			ВидОбъекта 		  = ?(МетаданныеОбъекта = Неопределено, "", МетаданныеОбъекта.ПолноеИмя());
		
			Если ВидОбъекта = "Справочник.НастройкиИнтеграцииСПлатежнымиСистемами" Тогда

				НастройкиПодключения.ИспользоватьОплатуСБП 					= Истина;
				НастройкиПодключения.ИспользоватьОплатуПлатежнымиСистемами 	= Истина;
				
			ИначеЕсли ВидОбъекта = "Справочник.НастройкиПодключенияКСистемеБыстрыхПлатежей" Тогда

				НастройкиПодключения.ИспользоватьОплатуСБП 					= Истина;
				НастройкиПодключения.ИспользоватьОплатуПлатежнымиСистемами 	= Истина;
				
			ИначеЕсли ВидОбъекта = "Справочник.НастройкиОнлайнОплат" Тогда

				НастройкиПодключения.ИспользоватьОплатуЮКасса 				= Истина;
				НастройкиПодключения.ИспользоватьОплатуПлатежнымиСистемами 	= Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НастройкиПодключения;
	
КонецФункции


#КонецОбласти

#КонецЕсли
